app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 953125641)

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 953125641)

  def create
    @team = Team.new(params[:team])

    if @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES(NULL, '2010-06-16 00:31:37', '2010-06-16 00:31:37')

  def update
    @team = Team.find(params[:id])

    if @team.update_attributes(params[:team])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 953125641)
UPDATE "teams" SET "updated_at" = '2010-06-16 00:44:28', "name" = 'Brazil' WHERE "id" = 953125641

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT * FROM "teams" WHERE ("teams"."id" = 953125641)
DELETE FROM "teams" WHERE "id" = 953125641